export class Ship {
  /** 艦ID */
  id = 0;
  /** 艦名 */
  name = "";
  /** 艦種ID */
  stype = 0;
  /** 艦型ID */
  ctype = 0;
  /** 耐久 */
  hp = 0;
  /** 火力 */
  fp = 0;
  /** 雷装 */
  tp = 0;
  /** 爆装 */
  bp = 0;
  /** 装甲 */
  ar = 0;
  /** 対空 */
  aa = 0;
  /** 回避 */
  ev = 0;
  /** 命中 */
  ac = 0;
  /** 対潜 */
  as = 0;
  /** 索敵 */
  ls = 0;
  /** 射程 */
  rn = 0;
  /** 運 */
  lk = 0;
  /** 速力 */
  sp = 0;
  /** スロット数 */
  slotnum = 0;
  /** 搭載機数 */
  slots = [0, 0, 0, 0, 0];
  /** 装備 */
  items: Item[] = [];
}

export class Item {
  /** 装備ID */
  id = 0;
  /** 装備名 */
  name = "";
  /** 装備タイプ */
  type = [0, 0, 0, 0, 0];
  /** 火力 */
  fp = 0;
  /** 雷装 */
  tp = 0;
  /** 爆装 */
  bp = 0;
  /** 装甲 */
  ar = 0;
  /** 対空 */
  aa = 0;
  /** 回避 */
  ev = 0;
  /** 命中 */
  ac = 0;
  /** 対潜 */
  as = 0;
  /** 索敵 */
  ls = 0;
  /** 射程 */
  rn = 0;
  /** 航続距離 */
  rd = 0;
  /** 配置コスト */
  bc = 0;
  /** 改修 */
  rf = 0;
  /** 熟練度 */
  mas = 0;
}
